src/DataProcessors/ГенераторСобытийПроцессаВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГенераторСобытийПроцессаВозвратов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СобытияАктовРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияАктовРассмотренияВозврата</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиДокументовПокупателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиДокументовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиДокументовПоставщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиДокументовПоставщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиБухгалтерией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиБухгалтерией</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыВозврата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СобытияКОбработкеАктовРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияКОбработкеАктовРассмотренияВозврата</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрСобытияПроцессаВозвратов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийКОбработкеПроцессаВозвратов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ГенераторСобытийПроцессаВозвратов/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ГенерацияСобытий();
	
КонецПроцедуры

Процедура ГенерацияСобытий()
	
	//ОтразитьПросрочкуВозвратаТовараКлиентом();
	
	ОтразитьЗавершениеПоОтказам()
	
КонецПроцедуры

//После перевода в отказ ждем 30 дней и завершаем процесс
Процедура ОтразитьЗавершениеПоОтказам()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ОтразитьЗавершениеПоОтказам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата,
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СтатусДокумента КАК СтатусДокумента,
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, ДЕНЬ), 0) КАК ПродолжительностьНахожденияВСтатусе
		|ИЗ
		|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
		|			,
		|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
		|				И СтатусДокумента = &СтатусДокумента
		|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата,
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СтатусДокумента
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, ДЕНЬ), 0) > &МаксДней";
	
	Запрос.УстановитьПараметр("СтатусДокумента", 	Справочники.СтатусыДокументов.АРВ_ГПРКОтказ);
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока", 		"");
	Запрос.УстановитьПараметр("МаксДней", 			30);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус, Выборка.СтатусДокумента);	

	КонецЦикла;
	
КонецПроцедуры

Процедура  ОтразитьПросрочкуВозвратаТовараКлиентом()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ОтразитьПросрочкуВозвратаТовараКлиентом";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//Есть вопросы. почему не смотрим на срок возврата товара в акте?
	Возврат;

	ДнейПросрочкиМакс = Константы.КоличествоДнейОжиданияПриемкиВозврата.Получить();
	
	Если ДнейПросрочкиМакс = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата КАК АктРассмотренияВозврата,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, МИНУТА), 0) КАК ПродолжительностьНахожденияВСтатусе
	|ИЗ
	|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
	|			,
	|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
	|				И НЕ АктРассмотренияВозврата.ПометкаУдаления
	|				И СтатусДокумента = &СтатусДокумента
	|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, МИНУТА), 0) > &МинутПросрочкиМакс";
	
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("МинутПросрочкиМакс", ДнейПросрочкиМакс*1440);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		 																		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ПросроченСрокВозвратаТовараКлиентом);	
	КонецЦикла;
	
	
КонецПроцедуры
